extractRC

add_ndr -width {M3 0.14 M4 0.14 M5 0.14 M6 0.14} -spacing {M3 0.14 M4 0.14 M5 0.14 M6 0.14} -name 2w2s

create_route_type -name clkroute -non_default_rule 2w2s -bottom_preferred_layer M3 -top_preferred_layer M6

set_ccopt_property -route_type clkroute -net_type trunk

set_ccopt_property -route_type clkroute -net_type leaf

set_ccopt_property -buffer_cells {CLKBUFX6 CLKBUFX12 CLKBUFX16 CLKBUFX8}

set_ccopt_property -inverter_cells {CLKINVX3 CLKINVX4 CLKINVX6 CLKINVX8 CLKINVX12 CLKINVX16}

create_ccopt_clock_tree_spec -file ccopt.spec

source ccopt.spec

ccopt_design -cts 
